# Question # 1

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                               '12. Air France', '"Swiss Air"']})
print(df)

a_val1 = np.where(df.FlightNumber.isnull(),df.index,0)-1
print(a_val1)

impute_values = df.iloc[a_val1[a_val1>=0]].FlightNumber + 10

df.FlightNumber[df.FlightNumber.isnull()] = list(impute_values) 

print(df)

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]
[-1  0 -1  2 -1]
               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)       10075.0      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France       10075.0    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

C:\Users\50003593\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:17: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [26]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [27]:
#df = df.From_To.map(lambda x: x.split('_')[-1])
df.head()

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

# Question # 2

In [28]:
df1 = pd.DataFrame(df.From_To.str.split('_',1).tolist(),columns = ['From','To'])

# Question # 3

In [29]:
df11 = df1.From.str.title()

In [30]:
df12 = df1.To.str.title()

In [31]:
frame =[df11,df12]
df2 = pd.concat(frame,axis=1)

# Question # 4

In [32]:
df3 = pd.concat([df,df2],axis=1)

In [33]:
df4 = df.join(df2.ix[:,'From':]) # another method of joining two dataframe = df.join(df2.ix[:,'From':]) or df.join(df2.ix[:,0:2])

C:\Users\50003593\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [34]:
df4

,Airline,FlightNumber,From_To,RecentDelays,From,To
0,KLM(!),10045.0,LoNDon_paris,"[23, 47]",London,Paris
1,<Air France> (12),NaN,MAdrid_miLAN,[],Madrid,Milan
2,(British Airways. ),10065.0,londON_StockhOlm,"[24, 43, 87]",London,Stockholm
3,12. Air France,NaN,Budapest_PaRis,[13],Budapest,Paris
4,"""Swiss Air""",10085.0,Brussels_londOn,"[67, 32]",Brussels,London

In [35]:
df3.drop(['From_To'],1,inplace=True)

In [36]:
df3.head()

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)       10045.0      [23, 47]    London      Paris
1    <Air France> (12)           NaN            []    Madrid      Milan
2  (British Airways. )       10065.0  [24, 43, 87]    London  Stockholm
3       12. Air France           NaN          [13]  Budapest      Paris
4          "Swiss Air"       10085.0      [67, 32]  Brussels     London